# Movie Recommender System

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [23]:
movie_titles = pd.read_csv('Movie_Id_Titles')

In [24]:
movie_titles

      item_id                                      title
0           1                           Toy Story (1995)
1           2                           GoldenEye (1995)
2           3                          Four Rooms (1995)
3           4                          Get Shorty (1995)
4           5                             Copycat (1995)
...       ...                                        ...
1677     1678                          Mat' i syn (1997)
1678     1679                           B. Monkey (1998)
1679     1680                       Sliding Doors (1998)
1680     1681                        You So Crazy (1994)
1681     1682  Scream of Stone (Schrei aus Stein) (1991)

[1682 rows x 2 columns]

In [26]:
movie_ratings = pd.read_csv('u.data',sep='\t',names=['user_id','item_id','rating','timestamp'])

In [27]:
movie_ratings

        user_id  item_id  rating  timestamp
0             0       50       5  881250949
1             0      172       5  881250949
2             0      133       1  881250949
3           196      242       3  881250949
4           186      302       3  891717742
...         ...      ...     ...        ...
99998       880      476       3  880175444
99999       716      204       5  879795543
100000      276     1090       1  874795795
100001       13      225       2  882399156
100002       12      203       3  879959583

[100003 rows x 4 columns]

In [35]:
movie_ratings.drop(columns='timestamp',axis=1,inplace=True)

In [36]:
movie_ratings

        user_id  item_id  rating
0             0       50       5
1             0      172       5
2             0      133       1
3           196      242       3
4           186      302       3
...         ...      ...     ...
99998       880      476       3
99999       716      204       5
100000      276     1090       1
100001       13      225       2
100002       12      203       3

[100003 rows x 3 columns]

In [37]:
movie_ratings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100003 entries, 0 to 100002
Data columns (total 3 columns):
 #   Column   Non-Null Count   Dtype
---  ------   --------------   -----
 0   user_id  100003 non-null  int64
 1   item_id  100003 non-null  int64
 2   rating   100003 non-null  int64
dtypes: int64(3)
memory usage: 2.3 MB

In [38]:
movie_ratings.describe()

             user_id        item_id         rating
count  100003.000000  100003.000000  100003.000000
mean      462.470876     425.520914       3.529864
std       266.622454     330.797791       1.125704
min         0.000000       1.000000       1.000000
25%       254.000000     175.000000       3.000000
50%       447.000000     322.000000       4.000000
75%       682.000000     631.000000       4.000000
max       943.000000    1682.000000       5.000000

In [42]:
movie_ratings.groupby('rating').describe()

        user_id                                                           \
          count        mean         std  min    25%    50%    75%    max
rating
1        6111.0  433.368843  263.404416  0.0  205.5  405.0  648.0  943.0
2       11370.0  472.553298  267.325575  1.0  255.0  454.0  698.0  943.0
3       27145.0  473.030061  263.417504  1.0  269.0  456.0  690.0  943.0
4       34174.0  464.684175  266.010865  1.0  264.0  450.0  682.0  943.0
5       21203.0  448.366222  271.003369  0.0  236.0  420.0  671.0  943.0

        item_id
          count        mean         std  min     25%    50%    75%     max
rating
1        6111.0  576.402389  398.190031  1.0  255.00  469.0  876.0  1678.0
2       11370.0  503.634477  362.471801  1.0  221.25  407.0  756.0  1680.0
3       27145.0  457.358077  339.085927  1.0  194.00  370.0  684.0  1682.0
4       34174.0  395.132615  307.848538  1.0  171.00  300.0  568.0  1674.0
5       21203.0  348.365892  285.407034  1.0  143.00  265.0  499.0  1656.0

In [46]:
movies = pd.merge(movie_ratings,movie_titles,on='item_id')

In [47]:
movies

,user_id,item_id,rating,title
0,0,50,5,Star Wars (1977)
1,290,50,5,Star Wars (1977)
2,79,50,4,Star Wars (1977)
3,2,50,5,Star Wars (1977)
4,8,50,5,Star Wars (1977)
...,...,...,...,...
99998,840,1674,4,Mamma Roma (1962)
99999,655,1640,3,"Eighth Day, The (1996)"
100000,655,1637,3,Girls Town (1996)
100001,655,1630,3,"Silence of the Palace, The (Saimt el Qusur) (1..."
100002,655,1641,3,Dadetown (1995)